group-reports/test-phase/results-after-queue/disk-throughput-tuning-protocol-B-sndbuf-2m/test-5.txt
readwrite-randomly-test-job: (g=0): rw=randrw, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
readwrite-randomly-test-job: Laying out IO file (1 file / 10240MiB)

readwrite-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=2658: Tue Jul 11 12:35:18 2023
   read: IOPS=200, BW=1601KiB/s (1639kB/s)(940MiB/601298msec)
    slat (usec): min=4, max=46576, avg=98.64, stdev=491.76
    clat (usec): min=172, max=2482.0k, avg=1273519.29, stdev=51362.64
     lat (msec): min=13, max=2483, avg=1273.62, stdev=51.36
    clat percentiles (msec):
     |  1.00th=[ 1250],  5.00th=[ 1267], 10.00th=[ 1267], 20.00th=[ 1267],
     | 30.00th=[ 1267], 40.00th=[ 1267], 50.00th=[ 1267], 60.00th=[ 1284],
     | 70.00th=[ 1284], 80.00th=[ 1284], 90.00th=[ 1284], 95.00th=[ 1284],
     | 99.00th=[ 1318], 99.50th=[ 1334], 99.90th=[ 1804], 99.95th=[ 2106],
     | 99.99th=[ 2366]
   bw (  KiB/s): min=   15, max=  510, per=6.27%, avg=100.30, stdev=39.47, samples=19089
   iops        : min=    1, max=   63, avg=12.26, stdev= 4.96, samples=19089
  write: IOPS=86, BW=690KiB/s (706kB/s)(405MiB/601298msec)
    slat (usec): min=6, max=208098, avg=173.56, stdev=2196.93
    clat (usec): min=1152, max=403273, avg=12716.60, stdev=14921.24
     lat (usec): min=1988, max=403324, avg=12891.88, stdev=15377.17
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    7], 40.00th=[    8], 50.00th=[   10], 60.00th=[   12],
     | 70.00th=[   14], 80.00th=[   17], 90.00th=[   24], 95.00th=[   32],
     | 99.00th=[   66], 99.50th=[   95], 99.90th=[  213], 99.95th=[  226],
     | 99.99th=[  305]
   bw (  KiB/s): min=   15, max=  272, per=7.33%, avg=50.49, stdev=33.25, samples=16322
   iops        : min=    1, max=   34, avg= 6.03, stdev= 4.18, samples=16322
  lat (usec)   : 250=0.01%
  lat (msec)   : 2=0.01%, 4=3.62%, 10=12.85%, 20=9.39%, 50=3.74%
  lat (msec)   : 100=0.41%, 250=0.15%, 500=0.04%, 750=0.03%, 1000=0.05%
  cpu          : usr=0.07%, sys=0.19%, ctx=172527, majf=0, minf=162
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=120299,51839,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1601KiB/s (1639kB/s), 1601KiB/s-1601KiB/s (1639kB/s-1639kB/s), io=940MiB (985MB), run=601298-601298msec
  WRITE: bw=690KiB/s (706kB/s), 690KiB/s-690KiB/s (706kB/s-706kB/s), io=405MiB (425MB), run=601298-601298msec

Disk stats (read/write):
    drbd1: ios=120299/51879, merge=0/0, ticks=153034871/657459, in_queue=153692330, util=99.45%, aggrios=120299/51919, aggrmerge=0/0, aggrticks=153064059/273046, aggrin_queue=153337105, aggrutil=92.75%
    dm-0: ios=120299/51919, merge=0/0, ticks=153064059/273046, in_queue=153337105, util=92.75%, aggrios=120299/51919, aggrmerge=0/0, aggrticks=153065946/271731, aggrin_queue=153251373, aggrutil=92.77%
  vdb: ios=120299/51919, merge=0/0, ticks=153065946/271731, in_queue=153251373, util=92.77%